[
  {
    "blog_id": "3220132c-99f8-4c68-ab7b-0e4b1f942065",
    "title": "Building a Web3 DApp A Detailed Step-by-Step Guide with Code Samples",
    "short_description": "Web3 decentralized applications (DApps) combine blockchain-based smart contracts, data indexing, off-chain storage, and user-friendly frontends to create powerful, decentralized experiences. In this comprehensive guide, we’ll walk through the full workflow for building a Web3 DApp, using an e-commerce escrow system as an example. We’ll provide detailed explanations and sample code for each step to make the process interactive and actionable. Whether you’re a beginner or an experienced developer, this guide will help you understand how to build a DApp from scratch.",
    "timestamp": "2025-07-16 07:29:19",
    "image": "https://storage.googleapis.com/personal-blog-darmajr.appspot.com/blog-content/1752650055841_DAppBackground.jpg",
    "image_alt": "DApp Background Cover",
    "slug": "Building-a-Web3-DApp-A-Detailed-Step-by-Step-Guide-with-Code-Samples",
    "index": "d4735e3a265e1"
  },
  {
    "blog_id": "0d80371b-0fdf-4b5c-9b51-ee540ced9ab5",
    "title": "Scalable Video Upload Architecture Using Pre-Signed URLs",
    "short_description": "Handling large video files (e.g., 100MB or more) for uploads can strain backend servers, causing performance bottlenecks, increased latency, and storage challenges. A scalable and efficient solution is to use pre-signed URLs with cloud storage services like AWS S3 or Google Cloud Storage (GCS). This architecture offloads the heavy lifting of file uploads to the cloud, reduces backend load, and ensures secure and optimized handling of large video files. Below is a detailed breakdown of the architecture, including components, workflow, security considerations, and implementation details.",
    "timestamp": "2025-07-05 12:27:43",
    "image": "https://storage.googleapis.com/personal-blog-darmajr.appspot.com/blog-content/1751717376607_presigned_url.jpg",
    "image_alt": "presigned url AWS",
    "slug": "Scalable-Video-Upload-Architecture-Using-Pre-Signed-URLs",
    "index": "d4735e3a265e1"
  },
  {
    "blog_id": "1da46d18-64b6-4ce0-9a1c-314992d3c75e",
    "title": "How to Stop Microservices Failures from Spreading with the Bulkhead Pattern",
    "short_description": "Microservices are awesome for building apps that scale and evolve quickly. But as your system grows, a small problem in one service can snowball into a disaster, taking down your entire application. This is called a cascading failure, and it’s a big challenge in microservices. The Bulkhead Pattern is a smart way to prevent this by isolating parts of your system so one failure doesn’t sink everything else.",
    "timestamp": "2025-06-22 02:12:50",
    "image": "https://storage.googleapis.com/personal-blog-darmajr.appspot.com/blog-content/1750557410651_bulkhead%20arch%20pattern%202.png",
    "image_alt": "bulkhead arch pattern",
    "slug": "How-to-Stop-Microservices-Failures-from-Spreading-with-the-Bulkhead-Pattern",
    "index": "d4735e3a265e1"
  }
]